In [2]:
import numpy as np
import pandas as pd

days = ["Mon","Tue","Wed","Thur","Fri"]
scores = pd.DataFrame([pd.Series([9.5, 8.75, 8, 10, 7.75], index=days, name="week_1"),
pd.Series([9, 8, 10, 8.75, 7.25], index=days, name="week_2"),
pd.Series([8.5, 8, 9.75, 9, 6], index=days, name="week_3"),
pd.Series([6.5, 8.25, 9, 8, 7.5], index=days, name="week_4")])

scores

        Mon   Tue    Wed   Thur   Fri
week_1  9.5  8.75   8.00  10.00  7.75
week_2  9.0  8.00  10.00   8.75  7.25
week_3  8.5  8.00   9.75   9.00  6.00
week_4  6.5  8.25   9.00   8.00  7.50

**1) [P] Report the number of dimensions, the shape, the size of the data, and the data types in the scores.**

In [10]:
print("number of dimensions is {}".format(scores.ndim))
print("shape is {}".format(scores.shape))
print("size of data is {}".format(scores.size))
print("data types in scores are: \n{}".format(scores.dtypes))

number of dimensions is 2
shape is (4, 5)
size of data is 20
data types in scores are:
Mon     float64
Tue     float64
Wed     float64
Thur    float64
Fri     float64
dtype: object

**2) [P] How many observations? How many variables (i.e. columns)?**

In [122]:
print("Number of observations is {}".format(scores.shape[0]))
print("The number of variables (columns) is {}".format(scores.shape[1]))

Number of observations is 4
The number of variables (columns) is 5

**3) [P] Rename the 'Thur' column header to be 'Thu' Show the new scores data frame**

In [18]:
scores.rename(columns={'Thur':'Thu'}, inplace=True)
scores

        Mon   Tue    Wed    Thu   Fri
week_1  9.5  8.75   8.00  10.00  7.75
week_2  9.0  8.00  10.00   8.75  7.25
week_3  8.5  8.00   9.75   9.00  6.00
week_4  6.5  8.25   9.00   8.00  7.50

**4) [P] Rename the index to be 'w1', 'w2', 'w3', and 'w4'. Rename the variables to be 'Mo', 'Tu', 'We',
'Th', 'Fr'.**

In [19]:
scores.rename(index= lambda x: "w" + x.strip('_')[-1], columns=lambda x: x[:2], inplace=True)
scores

     Mo    Tu     We     Th    Fr
w1  9.5  8.75   8.00  10.00  7.75
w2  9.0  8.00  10.00   8.75  7.25
w3  8.5  8.00   9.75   9.00  6.00
w4  6.5  8.25   9.00   8.00  7.50

**5) [M] Compare the type of the expression scores['Mo'] vs. scores[['Mo']]. What is the difference? Explain.**

In [20]:
scores['Mo']

w1    9.5
w2    9.0
w3    8.5
w4    6.5
Name: Mo, dtype: float64

In [21]:
scores[['Mo']]

     Mo
w1  9.5
w2  9.0
w3  8.5
w4  6.5

Using single brackets returns a pandas Series, whereas using double brackets
returns a DataFrame and is usually meant to be used for more than one column

**6) [M] What does the keys() method of data frames do? Demonstrate it on the scores data frame.**

In [22]:
scores.keys()

Index(['Mo', 'Tu', 'We', 'Th', 'Fr'], dtype='object')

The keys method returns the info axis, which in the case of DataFrames happens to be the variable/column names

**7) [M] Read about the describe() method of data frames. (FYI - This is essentially the equivalent to the
summary() function in R.)**

Generates descriptive statistics that summarize the central tendency, dispersion and shape of a dataset’s distribution (From Pandas docs)

**8) [P] Demonstrate the describe() method on scores. What type does it return? (This makes it quite
usable!) Look at the output. Which day had the largest standard deviation in quiz scores?**

In [23]:
scores.describe()

             Mo        Tu         We         Th        Fr
count  4.000000  4.000000   4.000000   4.000000  4.000000
mean   8.375000  8.250000   9.187500   8.937500  7.125000
std    1.314978  0.353553   0.898494   0.826009  0.777282
min    6.500000  8.000000   8.000000   8.000000  6.000000
25%    8.000000  8.000000   8.750000   8.562500  6.937500
50%    8.750000  8.125000   9.375000   8.875000  7.375000
75%    9.125000  8.375000   9.812500   9.250000  7.562500
max    9.500000  8.750000  10.000000  10.000000  7.750000

Describe method also returns a pandas DataFrame. Monday had the largest standard deviation in quiz scores.

**9) [P] Write code to directly determine which day had the largest standard deviation in quiz scores. Your result
should simply output the abbreviated name from the columns.**

In [29]:
stats = scores.describe()
stats.loc['std'].idxmax()

'Mo'

** 10) [P] Show the result of describe() on the transpose of the scores data frame. Which week had the best
average score?**

In [30]:
scores.T.describe()

              w1         w2        w3        w4
count   5.000000   5.000000  5.000000  5.000000
mean    8.800000   8.600000  8.250000  7.850000
std     0.958514   1.039832  1.414214  0.928709
min     7.750000   7.250000  6.000000  6.500000
25%     8.000000   8.000000  8.000000  7.500000
50%     8.750000   8.750000  8.500000  8.000000
75%     9.500000   9.000000  9.000000  8.250000
max    10.000000  10.000000  9.750000  9.000000

Week 1 had the best average score

**11) [M] What does the .values attribute do?**

In [31]:
scores.values

array([[  9.5 ,   8.75,   8.  ,  10.  ,   7.75],
       [  9.  ,   8.  ,  10.  ,   8.75,   7.25],
       [  8.5 ,   8.  ,   9.75,   9.  ,   6.  ],
       [  6.5 ,   8.25,   9.  ,   8.  ,   7.5 ]])

It returns an array representation of the DataFrame with the same dimensions

**12) [P] What is the mean of the entire dataset? (HINT: .values may make this easy)**

In [33]:
print('The mean is {}'.format(np.mean(scores.values)))

The mean is 8.375

**13) [P] What is the mean for each day? Do not use describe()**

In [35]:
scores.mean(axis=0)

Mo    8.3750
Tu    8.2500
We    9.1875
Th    8.9375
Fr    7.1250
dtype: float64

**14) [P] Select the data frame for only Monday – Thursday using .loc, and again using .iloc**

In [37]:
scores.loc[:,'Mo':'Th']

     Mo    Tu     We     Th
w1  9.5  8.75   8.00  10.00
w2  9.0  8.00  10.00   8.75
w3  8.5  8.00   9.75   9.00
w4  6.5  8.25   9.00   8.00

In [38]:
scores.iloc[:,0:4]

     Mo    Tu     We     Th
w1  9.5  8.75   8.00  10.00
w2  9.0  8.00  10.00   8.75
w3  8.5  8.00   9.75   9.00
w4  6.5  8.25   9.00   8.00

**15) [P] Show the mean for each week after your minimum score for each week was dropped.**

In [64]:
min_dropped = scores.T.replace(to_replace=dict(scores.min(axis=1)), value=np.NaN)
min_dropped.T.mean(axis=1)

w1    9.0625
w2    8.9375
w3    8.8125
w4    8.1875
dtype: float64

**16) [P] Select the weeks where Friday's score was greater than 7.25, using the [ ] operator**

In [67]:
scores[scores['Fr']>7.25]

     Mo    Tu   We    Th    Fr
w1  9.5  8.75  8.0  10.0  7.75
w4  6.5  8.25  9.0   8.0  7.50

**17) [P] Use the where() method to repeat the previous exercise.**

In [71]:
scores.where(scores['Fr']>7.25).dropna(axis=0)

     Mo    Tu   We    Th    Fr
w1  9.5  8.75  8.0  10.0  7.75
w4  6.5  8.25  9.0   8.0  7.50

**18) Select the data where each value is greater than the mean for all of the data.**

In [72]:
scores.where(scores > np.mean(scores.values))

     Mo    Tu     We     Th  Fr
w1  9.5  8.75    NaN  10.00 NaN
w2  9.0   NaN  10.00   8.75 NaN
w3  8.5   NaN   9.75   9.00 NaN
w4  NaN   NaN   9.00    NaN NaN

**19) [P] Select the scores where each value is greater than the week's mean value.**

In [109]:
scores.apply(lambda x: x.where(x>np.mean(x)), axis=1)

     Mo    Tu     We     Th  Fr
w1  9.5   NaN    NaN  10.00 NaN
w2  9.0   NaN  10.00   8.75 NaN
w3  8.5   NaN   9.75   9.00 NaN
w4  NaN  8.25   9.00   8.00 NaN

In [202]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
chip_df = pd.read_csv(url, sep = '\t')

**20) [P] How many columns in chip_df?**

In [115]:
chip_df.shape[1]

5

**21) [P] How many observations are there in chip_df?**

In [124]:
print("Total number of observations is {}".format(chip_df.shape[0]))

Total number of observations is 4622

**22) [P] Show the columns of chip_df**

In [119]:
print(chip_df.columns)

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

**23) [P] Show the first 10 observations of chip_df**

In [125]:
chip_df[:10]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

**24) [P] How many unique item_name entries are there?**

In [127]:
chip_df['item_name'].nunique()

50

**25) How many distinct orders are there?**

In [128]:
chip_df['order_id'].nunique()

1834

**26) [P] What were the top 5 ordered items? (Be sure to consider the quantity of each item order!) How many of
each were ordered?**

In [151]:
chip_df.groupby('item_name').sum().sort_values(['quantity'],ascending=False)[:5]

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

**27) [P] How many orders were for "Steak Burrito"?**

In [156]:
chip_df[chip_df['item_name'] == 'Steak Burrito'].shape[0]

368

**28) [P] What is the most frequent item ordered for "Steak Burrito" orders? (You need to explore the
choice_description variable!)**

In [175]:
items = chip_df[chip_df['item_name'] == 'Steak Burrito']['choice_description']
items.value_counts().index[0]

'[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice, Cheese, Sour Cream]]'

**29) [P] Run the describe() method on chip_df. Why are variables missing in the output? (Read the help for
describe()!)**

In [176]:
chip_df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

The default behavior is to only provide a summary for the numerical columns, and if we want to also include the variables which have a string dtype, we need to use the optional parameter: include='all'

**30) [P] Can you readily compute the mean of the "item_price" variable? If not, why not?**

In [184]:
chip_df['item_price'].dtype

dtype('O')

Observe that is not a numerical dtype (it's a string) and so the mean cannot be readily computed

**31) [P] Convert the item_price field to a floating point number. Confirm by showing the output of info()
NOTE – This is a classic example of the type of cleaning and preprocessing you need to always deal with when
working with data. We'll be doing a LOT of this very soon!**

In [203]:
chip_df['item_price'] = chip_df['item_price'].apply(lambda x: float(x.strip(' $')))
chip_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null float64
dtypes: float64(1), int64(2), object(2)
memory usage: 180.6+ KB

**32) [P] Compute the mean price for an order (NOTE – This is NOT just a mean of the item_price column!**

*If we do not consider the quantity of each item ordered*

In [208]:
chip_df.groupby('order_id').sum().mean()['item_price']

18.811428571428689

*If we do consider the quantity of each item ordered*

In [209]:
chip_df['item_x_quantity'] = chip_df['item_price'] * chip_df['quantity']
chip_df.groupby('order_id').sum().mean()['item_x_quantity']

21.394231188658654

**33) What was total revenue for the data? (NOTE - Make sure you consider the quantity variable!)**

In [210]:
chip_df['item_x_quantity'].sum()

39237.019999999997

**34) [P] Using Python and markdown, discuss the distribution of quantity – how many orders had quantity of 1?
How many had 2? What is the average quantity? Range of values? Etc.**

In [212]:
print('{} orders had a quantity of 1'.format(chip_df[chip_df['quantity'] == 1].shape[0]))
print('{} orders had a quantity of 2'.format(chip_df[chip_df['quantity'] == 2].shape[0]))
print("The mean and ranges are given below\n")
chip_df['quantity'].describe()

4355 orders had a quantity of 1
224 orders had a quantity of 2
The mean and ranges are given below

count    4622.000000
mean        1.075725
std         0.410186
min         1.000000
25%         1.000000
50%         1.000000
75%         1.000000
max        15.000000
Name: quantity, dtype: float64